from fastapi import FastAPI
import uvicorn

# Створюємо екземпляр FastAPI-додатку
app = FastAPI()

# Визначаємо маршрут (endpoint). Коли хтось зайде на головну сторінку ("/")
# нашого додатку, він отримає це повідомлення.
@app.get("/")
def read_root():
    return {"message": "Привіт, DevOps! Це наш перший додаток."}

# Цей блок дозволяє запускати додаток прямо з цього файлу,
# що корисно для локального тестування.
if __name__ == "__main__":
    # uvicorn - це сервер, який запускає FastAPI додатки.
    # "app:app" означає, що ми запускаємо об'єкт 'app' з файлу 'app.py'.
    # "--host 0.0.0.0" означає, що додаток буде доступний ззовні (не тільки з твого комп'ютера).
    # "--port 8000" - додаток слухатиме запити на порту 8000.
    uvicorn.run(app, host="0.0.0.0", port=8000)